Import numpy and pandas

In [1]:
import numpy as np
import pandas as pd

Create a python dictionary with 3 labels and 3 numbers of your choice.
Call it my_data.

In [3]:
my_data = {'year': 2019, 'month': 10, 'day': 29}
print(my_data)

{'year': 2019, 'month': 10, 'day': 29}

Create a pandas Series from the my_data dictionary, called my_series.
Display it.

In [10]:
my_series = pd.Series(my_data)
my_series

year     2019
month      10
day        29
dtype: int64

Create a 5x5 array of random integers, from 0 to 100 called nums.
Display it.

In [30]:
nums = np.random.randint(0, 100, (5,5))
#nums = nums.reshape((5,5))
nums

array([[56, 96, 18, 88, 42],
       [95,  5, 28, 98, 36],
       [73, 54, 78, 40, 27],
       [87, 32, 71, 60, 20],
       [51,  5, 81, 30, 91]])

Create a DataFrame from the nums array, called df.
Label the columns: A,B,C,D,E
Label the index: V,W,X,Y,Z
Display the DataFrame.

In [17]:
df = pd.DataFrame(nums, columns = ['A', 'B', 'C', 'D', 'E'], index = ['V', 'W', 'X', 'Y', 'Z'])
df

    A   B   C   D   E
V  34  36  20  63  43
W  52  29  61  15  55
X  53  42  21  41   2
Y  17  51  59   8  15
Z  20  65  43  37  18

Display columns B and D.

In [18]:
df[["B", "D"]]

    B   D
V  36  63
W  29  15
X  42  41
Y  51   8
Z  65  37

Display rows X and Y.

In [19]:
df.loc[["X", "Y"]]

    A   B   C   D   E
X  53  42  21  41   2
Y  17  51  59   8  15

Display element YC.

In [21]:
df.loc["Y", "C"]

59

Display rows X and Y, and columns B and D.

In [22]:
df.loc[["X", "Y"], ["B", "D"]]

    B   D
X  42  41
Y  51   8

Display the rows where the number in the 'A' column is greater than 50.

In [24]:
df[df["A"]>50]

    A   B   C   D   E
W  52  29  61  15  55
X  53  42  21  41   2

In [26]:
df #show the original table

    A   B   C   D   E
V  34  36  20  63  43
W  52  29  61  15  55
X  53  42  21  41   2
Y  17  51  59   8  15
Z  20  65  43  37  18

Add a new column F, which is column A x column B.
Display the resulting DataFrame.

In [27]:
df["F"] = df["A"] * df["B"]
df

    A   B   C   D   E     F
V  34  36  20  63  43  1224
W  52  29  61  15  55  1508
X  53  42  21  41   2  2226
Y  17  51  59   8  15   867
Z  20  65  43  37  18  1300

Permanently drop row V and column F.
Display the resulting DataFrame.

In [28]:
df.drop("V", axis=0, inplace=True)
df.drop("F", axis=1, inplace=True)
df

    A   B   C   D   E
W  52  29  61  15  55
X  53  42  21  41   2
Y  17  51  59   8  15
Z  20  65  43  37  18

Save the dataframe in a file called 'data10.csv'

In [29]:
df.to_csv('data10.csv')